{
  "format": "layers-model",
  "generatedBy": "katana-vision/train.py",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "katana_vision",
      "layers": [
        {
          "module": "keras.layers",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              1024
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_1"
          },
          "registered_name": null
        },
        {
          "module": "keras.layers",
          "class_name": "Reshape",
          "config": {
            "name": "reshape",
            "trainable": true,
            "dtype": "float32",
            "target_shape": [
              1024,
              1
            ]
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              1024
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d",
            "trainable": true,
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              8
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              1024,
              1
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d",
            "trainable": true,
            "dtype": "float32",
            "strides": [
              4
            ],
            "pool_size": [
              4
            ],
            "padding": "valid",
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              1024,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d_1",
            "trainable": true,
            "dtype": "float32",
            "filters": 64,
            "kernel_size": [
              4
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256,
              32
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d_1",
            "trainable": true,
            "dtype": "float32",
            "strides": [
              4
            ],
            "pool_size": [
              4
            ],
            "padding": "valid",
            "data_format": "channels_last"
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              256,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "GlobalAveragePooling1D",
          "config": {
            "name": "global_average_pooling1d",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last",
            "keepdims": false
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.3,
            "noise_shape": null,
            "seed": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        },
        {
          "module": "keras.layers",
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 6,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "module": "keras.initializers",
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registered_name": null
            },
            "bias_initializer": {
              "module": "keras.initializers",
              "class_name": "Zeros",
              "config": {},
              "registered_name": null
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "registered_name": null,
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        }
      ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv1d/kernel:0",
          "shape": [
            8,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/bias:0",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/kernel:0",
          "shape": [
            4,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel:0",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel:0",
          "shape": [
            64,
            6
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias:0",
          "shape": [
            6
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}